# Titanic: Machine Learning from Disaster

# Definição do Escopo

* Realizar o processo de Data Munging no dataset do tytanic;
* Gerar arquivos CSVs para o próximos projeto para aplicar os algoritmos machine learning;
* Os arquivos devem passar pelo processo de:
    * Análise Exploratória de Dados;
    * Análise Estatística de Dados;
    * Pré-Processamento;

# Objetivo

Gerar dataset(csv) limpo e formatado para aplicar no projeto algoritmos de ML para prever: 
* Que tipos de pessoas provavelmente sobreviveriam?

# Funções

In [100]:
def print_full(x):
    pd.set_option('display.max_rows', len(x))
    print(x)
    pd.reset_option('display.max_rows')

# Coleta de dados

https://www.kaggle.com/c/titanic/data

<b>PassengerId</b> = Passageiro ID<br>
<b>Survived</b> = Sobreviventes<br>
<b>Pclass</b> = Classe do Ingresso<br>
<b>Name</b> = Nome<br>
<b>Sex</b> = Sexo<br>
<b>Age</b> = Idade<br>
<b>SibSp</b> = Parentes Irmão/Irmã/Marido/Esposa<br>
<b>Parch</b> = Parentes Mãe/Pai/Filhos/Enteado<br>
<b>Ticket</b> = Passagem Número<br>
<b>Fare</b> = Passagem Preço<br>
<b>Cabin</b> = Cabine<br>
<b>Embarked</b> = Porto de Embarque(C = Cherbourg; Q = Queenstown; S = Southampton)<br>

## Fontes

In [1]:
### Importando as libs
import pandas as pd
import numpy as np

In [2]:
### Coletando as fontes de dados
train_csv = pd.read_csv('train.csv', sep = ',', encoding = 'UTF-8')
test_csv = pd.read_csv('test.csv', sep = ',', encoding = 'UTF-8')

## Validação - Importação dos dados

In [3]:
test_csv.head(2)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [4]:
train_csv.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

## Renomeando - Colunas

In [5]:
### Colunas de Teste
test=test_csv.copy()
colunasTeste=['PassageiroId','Classe','Nome','Sexo','Idade','ParentesIrmao','ParentesFilhos',
              'PassagemNumero','PassagemPreco','Cabine','PortoEmbarque']
test.columns=colunasTeste

In [6]:
### Colunas de Treino
train=train_csv.copy()
colunasTreino = colunasTeste[:]
colunasTreino.insert(1,'Sobreviventes')
train.columns=colunasTreino

## Validação - Renomeação das colunas

In [7]:
test.head(2)

,PassageiroId,Classe,Nome,Sexo,Idade,ParentesIrmao,ParentesFilhos,PassagemNumero,PassagemPreco,Cabine,PortoEmbarque
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [8]:
train.head(2)

,PassageiroId,Sobreviventes,Classe,Nome,Sexo,Idade,ParentesIrmao,ParentesFilhos,PassagemNumero,PassagemPreco,Cabine,PortoEmbarque
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

## Join Metadados

In [9]:
### União do Treino e Teste 
frames = [train[colunasTeste], test]
join = pd.concat(frames)

## Coleta de dados - Conclusão

<b>Dados de treino:</b> Possuí informações dos sobreviventes, então podemos utilizar algoritmos machine learning supervisionado.
<br>
<b>Dados de teste:</b> As previsões dos dados de teste deve ser enviado para o Kaggle, conforme o modelo: gender_submission.csv
<br>
<b>Join Metadados:</b> A união dos datasets de treino e teste vai ajudar no processo de análise exploratória dos dados.
<br>
<b>Join Metadados:</b> Foi excluído a coluna sobreviventes.

# Análise Exploratória de Dados

## Visualizar - 1ª Linhas

In [10]:
### Treino
train.head(20)

,PassageiroId,Sobreviventes,Classe,Nome,Sexo,Idade,ParentesIrmao,ParentesFilhos,PassagemNumero,PassagemPreco,Cabine,PortoEmbarque
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C

In [11]:
### Teste
test.head(20)

,PassageiroId,Classe,Nome,Sexo,Idade,ParentesIrmao,ParentesFilhos,PassagemNumero,PassagemPreco,Cabine,PortoEmbarque
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
6,898,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
7,899,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C
9,901,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S
10,902,3,"Ilieff, Mr. Ylio",male,NaN,0,0,349220,7.8958,NaN,S
11,903,1,"Jones, Mr. Charles Cresson",male,46.0,0,0,694,26.0000,NaN,S
12,904,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",female,23.0,1,0,21228,82.2667,B45,S
13,905,2,"Howard, Mr. Benjamin",male,63.0,1,0,24065,26.0000,NaN,S
14,906,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,47.0,1,0,W.E.P. 5734,61.1750,E31,S
15,907,2,"del Carlo, Mrs. Sebastiano (Argenia Genovesi)",female,24.0,1,0,SC/PARIS 2167,27.7208,NaN,C
16,908,2,"Keane, Mr. Daniel",male,35.0,0,0,233734,12.3500,NaN,Q
17,909,3,"Assaf, Mr. Gerios",male,21.0,0,0,2692,7.2250,NaN,C
18,910,3,"Ilmakangas, Miss. Ida Livija",female,27.0,1,0,STON/O2. 3101270,7.9250,NaN,S
19,911,3,"Assaf Khalil, Mrs. Mariana (Miriam"")""",female,45.0,0,0,2696,7.2250,NaN,C

## Quais as dimensões do dataset?

In [12]:
### Treino
train.shape

(891, 12)

In [13]:
### Teste
test.shape

(418, 11)

In [14]:
### JOIN
join.shape

(1309, 11)

<b>Dados de treino:</b> A quantidade de dados de treino aparentemente não é suficiente para ter um modelo com alta precisão.
<br>

## Quais são os tipos das colunas?

In [15]:
### Treino
train.dtypes

PassageiroId        int64
Sobreviventes       int64
Classe              int64
Nome               object
Sexo               object
Idade             float64
ParentesIrmao       int64
ParentesFilhos      int64
PassagemNumero     object
PassagemPreco     float64
Cabine             object
PortoEmbarque      object
dtype: object

In [16]:
### Teste
test.dtypes

PassageiroId        int64
Classe              int64
Nome               object
Sexo               object
Idade             float64
ParentesIrmao       int64
ParentesFilhos      int64
PassagemNumero     object
PassagemPreco     float64
Cabine             object
PortoEmbarque      object
dtype: object

In [17]:
### Join
join.dtypes

PassageiroId        int64
Classe              int64
Nome               object
Sexo               object
Idade             float64
ParentesIrmao       int64
ParentesFilhos      int64
PassagemNumero     object
PassagemPreco     float64
Cabine             object
PortoEmbarque      object
dtype: object

## Quais as colunas que tem valores nulos?

In [18]:
### Treino
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassageiroId      891 non-null int64
Sobreviventes     891 non-null int64
Classe            891 non-null int64
Nome              891 non-null object
Sexo              891 non-null object
Idade             714 non-null float64
ParentesIrmao     891 non-null int64
ParentesFilhos    891 non-null int64
PassagemNumero    891 non-null object
PassagemPreco     891 non-null float64
Cabine            204 non-null object
PortoEmbarque     889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [19]:
### Teste
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassageiroId      418 non-null int64
Classe            418 non-null int64
Nome              418 non-null object
Sexo              418 non-null object
Idade             332 non-null float64
ParentesIrmao     418 non-null int64
ParentesFilhos    418 non-null int64
PassagemNumero    418 non-null object
PassagemPreco     417 non-null float64
Cabine            91 non-null object
PortoEmbarque     418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [20]:
### Join
join.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 11 columns):
PassageiroId      1309 non-null int64
Classe            1309 non-null int64
Nome              1309 non-null object
Sexo              1309 non-null object
Idade             1046 non-null float64
ParentesIrmao     1309 non-null int64
ParentesFilhos    1309 non-null int64
PassagemNumero    1309 non-null object
PassagemPreco     1308 non-null float64
Cabine            295 non-null object
PortoEmbarque     1307 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 122.7+ KB

## Quais total de valores nulos por coluna?

In [21]:
### Treino
train.isnull().sum()

PassageiroId        0
Sobreviventes       0
Classe              0
Nome                0
Sexo                0
Idade             177
ParentesIrmao       0
ParentesFilhos      0
PassagemNumero      0
PassagemPreco       0
Cabine            687
PortoEmbarque       2
dtype: int64

In [22]:
### Teste
test.isnull().sum()

PassageiroId        0
Classe              0
Nome                0
Sexo                0
Idade              86
ParentesIrmao       0
ParentesFilhos      0
PassagemNumero      0
PassagemPreco       1
Cabine            327
PortoEmbarque       0
dtype: int64

In [23]:
### Join
join.isnull().sum()

PassageiroId         0
Classe               0
Nome                 0
Sexo                 0
Idade              263
ParentesIrmao        0
ParentesFilhos       0
PassagemNumero       0
PassagemPreco        1
Cabine            1014
PortoEmbarque        2
dtype: int64

## Sumário Estatístico

Resumo estatístico do DataFrame, com quartis, mediana, etc

<ul>
<li>count = quantidade de registros não nulo</li>
<li>mean = média aritmética</li>
<li>std = desvio padrão</li>
<li>min = minímo valor</li>
<li>25% = Primeiro Quartil</li>
<li>50% = Segundo Quartil = Mediana</li>
<li>75% = Terceiro Quartil</li>
<li>max = maior valor</li>
</ul>

### Dados - Brutos

In [24]:
### Treino 
train.describe()

,PassageiroId,Sobreviventes,Classe,Idade,ParentesIrmao,ParentesFilhos,PassagemPreco
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [25]:
### Teste
test.describe()

,PassageiroId,Classe,Idade,ParentesIrmao,ParentesFilhos,PassagemPreco
count,418.000000,418.000000,332.000000,418.000000,418.000000,417.000000
mean,1100.500000,2.265550,30.272590,0.447368,0.392344,35.627188
std,120.810458,0.841838,14.181209,0.896760,0.981429,55.907576
min,892.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,996.250000,1.000000,21.000000,0.000000,0.000000,7.895800
50%,1100.500000,3.000000,27.000000,0.000000,0.000000,14.454200
75%,1204.750000,3.000000,39.000000,1.000000,0.000000,31.500000
max,1309.000000,3.000000,76.000000,8.000000,9.000000,512.329200

In [26]:
### Join
join.describe()

,PassageiroId,Classe,Idade,ParentesIrmao,ParentesFilhos,PassagemPreco
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000
mean,655.000000,2.294882,29.881138,0.498854,0.385027,33.295479
std,378.020061,0.837836,14.413493,1.041658,0.865560,51.758668
min,1.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,328.000000,2.000000,21.000000,0.000000,0.000000,7.895800
50%,655.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,982.000000,3.000000,39.000000,1.000000,0.000000,31.275000
max,1309.000000,3.000000,80.000000,8.000000,9.000000,512.329200

### Sumário Estatístico(Dados Brutos) - Conclusão

* **PassageiroId:** 
    * Treino: Desconsiderar os valores relacionados a coluna.
    * Teste:  Desconsiderar os valores relacionados a coluna.
    * União:  Desconsiderar os valores relacionados a coluna.
* **Sobreviventes:** 
    * Treino: Aproximadamente 38% sobreviveu - mean 0.383838
* **Classe:** 
    * A mediana é a melhor representação da Classe.(50% do Quartil);  
    * Corresponde a 3ª classe como maioria nos dados de treino e test.
    * A mediana é a melhor representação da Classe;     
* **Idade:** 
* **ParentesIrmao:**
* **ParentesFilhos:** 
* **PassagemPreco:**

### É possível trabalhar com dataset removendo os valores nulos?

In [27]:
join.dropna().info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 270 entries, 1 to 414
Data columns (total 11 columns):
PassageiroId      270 non-null int64
Classe            270 non-null int64
Nome              270 non-null object
Sexo              270 non-null object
Idade             270 non-null float64
ParentesIrmao     270 non-null int64
ParentesFilhos    270 non-null int64
PassagemNumero    270 non-null object
PassagemPreco     270 non-null float64
Cabine            270 non-null object
PortoEmbarque     270 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 25.3+ KB

#### Conclusão
* Se remover todas as colunas com valores nulos fica inviável trabalhar com dataset;
* A coluna Cabine existe vários valores nulos;

### Dados - Sem nulos

In [28]:
colunasSemCabine = colunasTeste[:]
colunasSemCabine.remove('Cabine')

In [29]:
#Valor total - bruto: 891
#Valor total - Sem Nulos: 712
train_dropna=train.dropna(subset=colunasSemCabine)
train_dropna.describe()

,PassageiroId,Sobreviventes,Classe,Idade,ParentesIrmao,ParentesFilhos,PassagemPreco
count,712.000000,712.000000,712.000000,712.000000,712.000000,712.000000,712.000000
mean,448.589888,0.404494,2.240169,29.642093,0.514045,0.432584,34.567251
std,258.683191,0.491139,0.836854,14.492933,0.930692,0.854181,52.938648
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,222.750000,0.000000,1.000000,20.000000,0.000000,0.000000,8.050000
50%,445.000000,0.000000,2.000000,28.000000,0.000000,0.000000,15.645850
75%,677.250000,1.000000,3.000000,38.000000,1.000000,1.000000,33.000000
max,891.000000,1.000000,3.000000,80.000000,5.000000,6.000000,512.329200

In [30]:
#Valor total - bruto: 418
#Valor total - Sem Nulos: 331
test_dropna=test.dropna(subset=colunasSemCabine)
test_dropna.describe()

,PassageiroId,Classe,Idade,ParentesIrmao,ParentesFilhos,PassagemPreco
count,331.000000,331.000000,331.000000,331.000000,331.000000,331.000000
mean,1100.232628,2.141994,30.181269,0.483384,0.398792,40.982087
std,122.910180,0.846251,14.104573,0.875004,0.811582,61.228558
min,892.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,992.500000,1.000000,21.000000,0.000000,0.000000,8.050000
50%,1100.000000,2.000000,27.000000,0.000000,0.000000,16.000000
75%,1210.500000,3.000000,39.000000,1.000000,1.000000,40.633350
max,1307.000000,3.000000,76.000000,8.000000,6.000000,512.329200

In [31]:
#Valor total - bruto: 1309
#Valor total - Sem Nulos: 1043
join_dropna=join.dropna(subset=colunasSemCabine)
join_dropna.describe()

,PassageiroId,Classe,Idade,ParentesIrmao,ParentesFilhos,PassagemPreco
count,1043.000000,1043.000000,1043.000000,1043.000000,1043.000000,1043.000000
mean,655.391179,2.209012,29.813202,0.504314,0.421860,36.603024
std,377.527036,0.840685,14.366254,0.913080,0.840655,55.753648
min,1.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,326.500000,1.000000,21.000000,0.000000,0.000000,8.050000
50%,662.000000,2.000000,28.000000,0.000000,0.000000,15.750000
75%,973.500000,3.000000,39.000000,1.000000,1.000000,35.077100
max,1307.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## Balanceamento

### Qual a quantidade de sobreviventes nos dados de treino?

In [32]:
train.groupby('Sobreviventes').size()

Sobreviventes
0    549
1    342
dtype: int64

### Qual a quantidade de sobreviventes nos dados de treino sem os campos nulos?

In [33]:
train_dropna.groupby('Sobreviventes').size()

Sobreviventes
0    424
1    288
dtype: int64

### Existe algum porto de embarque que sobreviveu mais pessoas ou todos sobreviveram por não embarcar?

In [37]:
### Resposta: Não
train.groupby(['Sobreviventes','PortoEmbarque']).size()

Sobreviventes  PortoEmbarque
0              C                 75
               Q                 47
               S                427
1              C                 93
               Q                 30
               S                217
dtype: int64

### Quem tinha filhos sobreviveu mais do que morreu?

In [43]:
### Resposta: Não. Mas que não tinha filhos morreu mais e ninguem sobreviveu que tinha 4 e 6 parentes.
### 4 e 6 = 0 = Morreu
### 0,1,2,3,5 = 1 = Talvez
train.groupby(['Sobreviventes','ParentesFilhos','Sexo','Classe']).size()

Sobreviventes  ParentesFilhos  Sexo    Classe
0              0               female  1           1
                                       2           5
                                       3          35
                               male    1          63
                                       2          81
                                       3         260
               1               female  2           1
                                       3          13
                               male    1          10
                                       2           7
                                       3          22
               2               female  1           2
                                       3          17
                               male    1           3
                                       2           3
                                       3          15
               3               female  3           1
                               male    3           1
               4               female  3           2
                               male    1           1
                                       3           1
               5               female  3           3
                               male    3           1
               6               female  3           1
1              0               female  1          63
                                       2          40
                                       3          50
                               male    1          36
                                       2           8
                                       3          36
               1               female  1          17
                                       2          17
                                       3          12
                               male    1           4
                                       2           7
                                       3           8
               2               female  1          11
                                       2          11
                                       3           8
                               male    1           5
                                       2           2
                                       3           3
               3               female  2           2
                                       3           1
               5               female  3           1
dtype: int64

### Existem nos dados teste pessoas que tem mais que 6 filhos?

In [42]:
### Sim 9. 
test.groupby(['ParentesFilhos']).size()

ParentesFilhos
0    324
1     52
2     33
3      3
4      2
5      1
6      1
9      2
dtype: int64

### Quem tinhas mais parentes sobreviveu?

In [45]:
### Resposta: Não. Mas que não tinha parantes morreu mais e ninguem sobreviveu que tinha 5,6,7,8 parentes.
### 5,6,7,8   = 0 = Morreu
### 0,1,2.3,4   = 1 = Talvez
train.groupby(['Sobreviventes','ParentesIrmao']).size()

Sobreviventes  ParentesIrmao
0              0                398
               1                 97
               2                 15
               3                 12
               4                 15
               5                  5
               8                  7
1              0                210
               1                112
               2                 13
               3                  4
               4                  3
dtype: int64

### Existem nos dados teste pessoas que tem mais que 8 parentes?

In [46]:
### Não.
test.groupby(['ParentesIrmao']).size()

ParentesIrmao
0    283
1    110
2     14
3      4
4      4
5      1
8      2
dtype: int64

### Sobreviveu mais mulheres ou homens?

In [48]:
### Resposta: Sobreviveu mais mulheres e morreu menos mulheres.
train.groupby(['Sobreviventes','Sexo']).size()

Sobreviventes  Sexo
0              female     81
               male      468
1              female    233
               male      109
dtype: int64

### Existem pessoas com mesmo número de passagem?

In [132]:
### Resposta: Sim
mesmo_numero_passagem=train.groupby(['Sobreviventes','PassagemNumero']).size()
print_full(mesmo_numero_passagem)

Sobreviventes  PassagemNumero
0              110413                1
               110465                2
               111240                1
               111320                1
               112050                1
               112052                1
               112058                1
               112059                1
               112379                1
               113028                1
               113043                1
               113050                1
               113051                1
               113056                1
               113059                1
               113501                1
               113503                1
               113509                1
               113510                1
               113514                1
               113767                1
               113773                1
               113776                1
               113781                2
               113784                1
               113787                1
               113789                1
               113792                1
               113796                1
               113798                1
               113800                1
               113803                1
               113807                1
               11668                 2
               11771                 1
               12233                 1
               12460                 1
               13049                 1
               13507                 1
               13509                 1
               14973                 1
               1601                  2
               17421                 1
               17463                 1
               17764                 1
               19877                 1
               19928                 1
               19950                 2
               19972                 1
               211536                1
               21440                 1
               218629                1
               219533                1
               220367                1
               2223                  1
               229236                1
               230080                1
               231945                1
               233639                1
               233866                1
               234360                1
               234686                1
               236171                1
               236853                1
               237442                1
               237565                1
               237671                1
               237736                1
               239853                3
               239854                1
               239855                1
               239856                1
               239865                2
               243847                1
               244252                2
               244278                1
               244310                1
               244358                1
               244361                1
               244367                1
               248723                1
               248727                1
               248731                1
               248740                1
               248747                1
               250643                1
               250646                1
               250647                2
               250651                1
               250653                1
               250655                1
               2623                  1
               2624                  1
               2627                  2
               2628                  1
               2629                  1
               2631                  1
               2641                  1
               2647                  1
               2648                  1
               2659                  1
               2662                  1
               2664                  1
               2665                  2
               2669                  1
               26707                 1
               2671                  1
               2672                  1
               2674                  1
               2678                  2
               2680                  1
               2683                  1
               2685                  1
               2686                  1
               2689                  1
               2690                  1
               2691                  2
               2693                  1
               2694                  1
               2695                  1
               2697                  1
               2699                  1
               2700                  1
               28134                 1
               28206                 1
               28213                 1
               28228                 1
               28403                 2
               28424                 1
               28425                 1
               28664                 1
               28665                 1
               29011                 1
               29104                 1
               29108                 1
               29750                 1
               29751                 1
               3101264               1
               3101267               1
               3101276               1
               3101277               1
               3101278               1
               3101295               6
               3101296               1
               31027                 1
               31028                 1
               312992                1
               312993                1
               315037                1
               315082                1
               315084                1
               315086                1
               315088                1
               315089                1
               315090                1
               315093                1
               315094                1
               315096                1
               315097                1
               315151                1
               323592                1
               323951                1
               324669                1
               330877                1
               330909                1
               330935                1
               330979                1
               334912                1
               335097                1
               336439                1
               3411                  1
               341826                1
               342826                1
               343095                1
               343275                1
               343276                1
               345364                1
               345763                1
               345764                2
               345765                1
               345767                1
               345769                1
               345770                1
               345773                3
               345777                1
               345778                1
               345780                1
               345781                1
               345783                1
               3460                  1
               347054                2
               347060                1
               347061                1
               347062                1
               347063                1
               347064                1
               347067                1
               347068                1
               347069                1
               347071                1
               347073                1
               347074                1
               347076                1
               347077                1
               347078                1
               347080                2
               347082                7
               347087                1
               347088                6
               3474                  1
               347464                1
               347466                1
               347468                1
               347743                1
               348121                1
               348123                1
               348124                1
               349201                1
               349203                1
               349204                1
               349205                1
               349206                1
               349207                1
               349208                1
               349209                1
               349210                1
               349212                1
               349213                1
               349214                1
               349215                1
               349216                1
               349217                1
               349218                1
               349219                1
               349221                1
               349222                1
               349223                1
               349224                1
               349225                1
               349227                1
               349228                1
               349231                1
               349233                1
               349234                1
               349236                1
               349237                2
               349239                1
               349241                1
               349242                1
               349243                1
               349245                1
               349246                1
               349247                1
               349248                1
               349249                1
               349251                1
               349252                1
               349253                1
               349254                1
               349257                1
               349909                4
               349910                1
               349912                1
               350025                1
               350026                1
               350029                1
               350035                1
               350036                1
               350042                1
               350047                1
               350048                1
               350050                1
               350052                1
               350060                1
               350404                1
               350406                1
               350407                1
               35273                 1
               35281                 2
               358585                2
               36209                 1
               362316                1
               363291                1
               363294                1
               363592                1
               364498                1
               364499                1
               364500                1
               364506                1
               364511                1
               364512                1
               364846                1
               364848                1
               364849                2
               364850                1
               364851                1
               365222                1
               365226                1
               36568                 1
               367229                1
               367232                1
               367655                1
               368323                1
               36864                 1
               36865                 1
               368703                1
               36963                 1
               36967                 1
               36973                 1
               370129                2
               370365                1
               370369                1
               370371                1
               370372                1
               370376                1
               370377                1
               371060                1
               371110                2
               371362                1
               372622                1
               373450                1
               374746                1
               374887                1
               374910                1
               376564                1
               376566                1
               382649                1
               382652                5
               383121                1
               384461                1
               392092                1
               394140                1
               4133                  4
               4135                  1
               4136                  1
               4137                  1
               4579                  1
               54636                 2
               5727                  1
               65303                 1
               65304                 1
               6563                  1
               693                   1
               695                   1
               7267                  1
               7534                  2
               7540                  1
               7545                  1
               7546                  1
               7552                  1
               7553                  1
               8471                  1
               8475                  1
               A./5. 2152            1
               A./5. 3235            1
               A.5. 11206            1
               A.5. 18509            1
               A/4 45380             1
               A/4 48871             2
               A/4. 20589            1
               A/4. 34244            1
               A/4. 39886            1
               A/5 21171             1
               A/5 21172             1
               A/5 21173             1
               A/5 21174             1
               A/5 2466              1
               A/5 2817              1
               A/5 3536              1
               A/5 3594              1
               A/5 3902              1
               A/5. 13032            1
               A/5. 2151             1
               A/5. 3336             2
               A/5. 3337             1
               A/5. 851              1
               A/S 2816              1
               A4. 54510             1
               C 4001                1
               C 7075                1
               C 7076                1
               C.A. 17248            1
               C.A. 18723            1
               C.A. 2315             1
               C.A. 24579            1
               C.A. 24580            1
               C.A. 2673             1
               C.A. 29178            1
               C.A. 29566            1
               C.A. 31921            1
               C.A. 33111            1
               C.A. 33112            1
               C.A. 34651            1
               C.A. 5547             1
               C.A. 6212             1
               C.A./SOTON 34068      1
               CA 2144               6
               CA. 2343              7
               F.C. 12750            1
               F.C.C. 13529          1
               Fa 265302             1
               LINE                  3
               P/PP 3381             1
               PC 17318              1
               PC 17483              1
               PC 17558              1
               PC 17582              1
               PC 17590              1
               PC 17593              2
               PC 17595              1
               PC 17596              1
               PC 17597              1
               PC 17600              1
               PC 17601              1
               PC 17604              1
               PC 17605              1
               PC 17609              1
               PC 17612              1
               PC 17754              1
               PC 17757              1
               PC 17758              1
               PC 17760              1
               PC 17761              1
               PP 4348               1
               S.C./A.4. 23567       1
               S.C./PARIS 2079       1
               S.O./P.P. 3           2
               S.O./P.P. 751         1
               S.O.C. 14879          5
               S.O.P. 1166           1
               S.P. 3464             1
               SC/AH 29037           1
               SC/PARIS 2131         1
               SC/PARIS 2133         1
               SC/PARIS 2167         1
               SC/Paris 2123         1
               SC/Paris 2163         1
               SCO/W 1585            1
               SOTON/O.Q. 3101305    1
               SOTON/O.Q. 3101306    1
               SOTON/O.Q. 3101307    1
               SOTON/O.Q. 3101310    1
               SOTON/O.Q. 3101311    1
               SOTON/O.Q. 3101312    1
               SOTON/O.Q. 392087     1
               SOTON/O2 3101272      1
               SOTON/O2 3101287      1
               SOTON/OQ 3101316      1
               SOTON/OQ 3101317      1
               SOTON/OQ 392076       1
               SOTON/OQ 392082       1
               SOTON/OQ 392086       1
               SOTON/OQ 392090       1
               STON/O 2. 3101273     1
               STON/O 2. 3101274     1
               STON/O 2. 3101275     1
               STON/O 2. 3101280     1
               STON/O 2. 3101292     1
               STON/O 2. 3101293     1
               STON/O 2. 3101294     1
               STON/O2. 3101271      1
               STON/O2. 3101279      1
               STON/O2. 3101290      1
               W./C. 14263           1
               W./C. 6607            2
               W./C. 6608            4
               W./C. 6609            1
               W.E.P. 5734           1
               W/C 14208             1
               WE/P 5735             1
1              110152                3
               110413                2
               110564                1
               110813                1
               111361                2
               111369                1
               111426                1
               111427                1
               111428                1
               112053                1
               112277                1
               113055                1
               113505                2
               113572                2
               113760                4
               113776                1
               113781                2
               113783                1
               113786                1
               113788                1
               113789                1
               113794                1
               113798                1
               113803                1
               113804                1
               113806                2
               11751                 2
               11752                 1
               11753                 1
               11755                 1
               11765                 1
               11767                 2
               11769                 1
               11774                 1
               11813                 1
               11967                 2
               12749                 2
               13213                 1
               13214                 1
               13502                 3
               13507                 1
               13567                 1

### As pessoas com mesmo número de passagem sobreviveram?

In [133]:
### Resposta: Não
df_mesmo_numero_passagem = pd.DataFrame({'Sobreviventes':mesmo_numero_passagem.index.get_level_values(0),'Passagem':mesmo_numero_passagem.index.get_level_values(1), 'PassagemQuantidade':mesmo_numero_passagem.values})
df_mesmo_numero_passagem.groupby(['Sobreviventes','PassagemQuantidade']).size()

Sobreviventes  PassagemQuantidade
0              1                     428
               2                      29
               3                       3
               4                       3
               5                       2
               6                       3
               7                       2
1              1                     195
               2                      52
               3                      10
               4                       2
               5                       1
dtype: int64